#include "include.h"

 /**
  * @brief Зависимость напряжения от освещенности. Аппроксимация полиномом 10й степени
  * @param x - освещенность W/m2
  * @note На выходе получается напряжение в В для PV
  */
double volt_illum_func(double x)
{
    double voltage = -1.4161664835639534 + 0.4973725819227123*x + -0.022539956113439615*x*x + 0.0005107168227857588*x*x*x + -6.551716589662537e-06*x*x*x*x + 5.170169386359444e-08*x*x*x*x*x + -2.5976993176473945e-10*x*x*x*x*x*x + 8.330210752860122e-13*x*x*x*x*x*x*x + -1.6501463235380724e-15*x*x*x*x*x*x*x*x + 1.83936948637939e-18*x*x*x*x*x*x*x*x*x + -8.821975832278624e-22*x*x*x*x*x*x*x*x*x*x;

    return voltage;
}